backend/testing/k6/hasil-stresstest.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 2m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/200 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 002/200 VUs  0m01.0s/2m00.0s

running (0m02.0s), 004/200 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 004/200 VUs  0m02.0s/2m00.0s

running (0m03.0s), 005/200 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 005/200 VUs  0m03.0s/2m00.0s

running (0m04.0s), 007/200 VUs, 11 complete and 0 interrupted iterations
default   [   3% ] 007/200 VUs  0m04.0s/2m00.0s

running (0m05.0s), 009/200 VUs, 18 complete and 0 interrupted iterations
default   [   4% ] 009/200 VUs  0m05.0s/2m00.0s

running (0m06.0s), 010/200 VUs, 27 complete and 0 interrupted iterations
default   [   5% ] 010/200 VUs  0m06.0s/2m00.0s

running (0m07.0s), 012/200 VUs, 37 complete and 0 interrupted iterations
default   [   6% ] 012/200 VUs  0m07.0s/2m00.0s

running (0m08.0s), 014/200 VUs, 49 complete and 0 interrupted iterations
default   [   7% ] 014/200 VUs  0m08.0s/2m00.0s

running (0m09.0s), 015/200 VUs, 63 complete and 0 interrupted iterations
default   [   7% ] 015/200 VUs  0m09.0s/2m00.0s

running (0m10.0s), 017/200 VUs, 78 complete and 0 interrupted iterations
default   [   8% ] 017/200 VUs  0m10.0s/2m00.0s

running (0m11.0s), 018/200 VUs, 95 complete and 0 interrupted iterations
default   [   9% ] 018/200 VUs  0m11.0s/2m00.0s

running (0m12.0s), 020/200 VUs, 112 complete and 0 interrupted iterations
default   [  10% ] 020/200 VUs  0m12.0s/2m00.0s

running (0m13.0s), 022/200 VUs, 132 complete and 0 interrupted iterations
default   [  11% ] 022/200 VUs  0m13.0s/2m00.0s

running (0m14.0s), 023/200 VUs, 154 complete and 0 interrupted iterations
default   [  12% ] 023/200 VUs  0m14.0s/2m00.0s

running (0m15.0s), 025/200 VUs, 177 complete and 0 interrupted iterations
default   [  12% ] 025/200 VUs  0m15.0s/2m00.0s

running (0m16.0s), 027/200 VUs, 202 complete and 0 interrupted iterations
default   [  13% ] 027/200 VUs  0m16.0s/2m00.0s

running (0m17.0s), 028/200 VUs, 229 complete and 0 interrupted iterations
default   [  14% ] 028/200 VUs  0m17.0s/2m00.0s

running (0m18.0s), 030/200 VUs, 257 complete and 0 interrupted iterations
default   [  15% ] 030/200 VUs  0m18.0s/2m00.0s

running (0m19.0s), 031/200 VUs, 287 complete and 0 interrupted iterations
default   [  16% ] 031/200 VUs  0m19.0s/2m00.0s

running (0m20.0s), 033/200 VUs, 318 complete and 0 interrupted iterations
default   [  17% ] 033/200 VUs  0m20.0s/2m00.0s

running (0m21.0s), 035/200 VUs, 351 complete and 0 interrupted iterations
default   [  17% ] 035/200 VUs  0m21.0s/2m00.0s

running (0m22.0s), 036/200 VUs, 385 complete and 0 interrupted iterations
default   [  18% ] 036/200 VUs  0m22.0s/2m00.0s

running (0m23.0s), 038/200 VUs, 421 complete and 0 interrupted iterations
default   [  19% ] 038/200 VUs  0m23.0s/2m00.0s

running (0m24.0s), 040/200 VUs, 459 complete and 0 interrupted iterations
default   [  20% ] 040/200 VUs  0m24.0s/2m00.0s

running (0m25.0s), 041/200 VUs, 499 complete and 0 interrupted iterations
default   [  21% ] 041/200 VUs  0m25.0s/2m00.0s

running (0m26.0s), 043/200 VUs, 540 complete and 0 interrupted iterations
default   [  22% ] 043/200 VUs  0m26.0s/2m00.0s

running (0m27.0s), 045/200 VUs, 583 complete and 0 interrupted iterations
default   [  22% ] 045/200 VUs  0m27.0s/2m00.0s

running (0m28.0s), 046/200 VUs, 628 complete and 0 interrupted iterations
default   [  23% ] 046/200 VUs  0m28.0s/2m00.0s

running (0m29.0s), 048/200 VUs, 674 complete and 0 interrupted iterations
default   [  24% ] 048/200 VUs  0m29.0s/2m00.0s

running (0m30.0s), 049/200 VUs, 722 complete and 0 interrupted iterations
default   [  25% ] 049/200 VUs  0m30.0s/2m00.0s

running (0m31.0s), 051/200 VUs, 771 complete and 0 interrupted iterations
default   [  26% ] 051/200 VUs  0m31.0s/2m00.0s

running (0m32.0s), 053/200 VUs, 821 complete and 0 interrupted iterations
default   [  27% ] 053/200 VUs  0m32.0s/2m00.0s

running (0m33.0s), 054/200 VUs, 874 complete and 0 interrupted iterations
default   [  27% ] 054/200 VUs  0m33.0s/2m00.0s

running (0m34.0s), 056/200 VUs, 927 complete and 0 interrupted iterations
default   [  28% ] 056/200 VUs  0m34.0s/2m00.0s

running (0m35.0s), 058/200 VUs, 982 complete and 0 interrupted iterations
default   [  29% ] 058/200 VUs  0m35.0s/2m00.0s

running (0m36.0s), 059/200 VUs, 1039 complete and 0 interrupted iterations
default   [  30% ] 059/200 VUs  0m36.0s/2m00.0s

running (0m37.0s), 061/200 VUs, 1098 complete and 0 interrupted iterations
default   [  31% ] 061/200 VUs  0m37.0s/2m00.0s

running (0m38.0s), 063/200 VUs, 1159 complete and 0 interrupted iterations
default   [  32% ] 063/200 VUs  0m38.0s/2m00.0s

running (0m39.0s), 064/200 VUs, 1222 complete and 0 interrupted iterations
default   [  32% ] 064/200 VUs  0m39.0s/2m00.0s

running (0m40.0s), 066/200 VUs, 1286 complete and 0 interrupted iterations
default   [  33% ] 066/200 VUs  0m40.0s/2m00.0s

running (0m41.0s), 068/200 VUs, 1352 complete and 0 interrupted iterations
default   [  34% ] 068/200 VUs  0m41.0s/2m00.0s

running (0m42.0s), 069/200 VUs, 1420 complete and 0 interrupted iterations
default   [  35% ] 069/200 VUs  0m42.0s/2m00.0s

running (0m43.0s), 071/200 VUs, 1489 complete and 0 interrupted iterations
default   [  36% ] 071/200 VUs  0m43.0s/2m00.0s

running (0m44.0s), 073/200 VUs, 1560 complete and 0 interrupted iterations
default   [  37% ] 073/200 VUs  0m44.0s/2m00.0s

running (0m45.0s), 074/200 VUs, 1633 complete and 0 interrupted iterations
default   [  37% ] 074/200 VUs  0m45.0s/2m00.0s

running (0m46.0s), 076/200 VUs, 1707 complete and 0 interrupted iterations
default   [  38% ] 076/200 VUs  0m46.0s/2m00.0s

running (0m47.0s), 078/200 VUs, 1783 complete and 0 interrupted iterations
default   [  39% ] 078/200 VUs  0m47.0s/2m00.0s

running (0m48.0s), 079/200 VUs, 1861 complete and 0 interrupted iterations
default   [  40% ] 079/200 VUs  0m48.0s/2m00.0s

running (0m49.0s), 081/200 VUs, 1940 complete and 0 interrupted iterations
default   [  41% ] 081/200 VUs  0m49.0s/2m00.0s

running (0m50.0s), 083/200 VUs, 2021 complete and 0 interrupted iterations
default   [  42% ] 083/200 VUs  0m50.0s/2m00.0s

running (0m51.0s), 084/200 VUs, 2103 complete and 0 interrupted iterations
default   [  42% ] 084/200 VUs  0m51.0s/2m00.0s

running (0m52.0s), 086/200 VUs, 2187 complete and 0 interrupted iterations
default   [  43% ] 086/200 VUs  0m52.0s/2m00.0s

running (0m53.0s), 088/200 VUs, 2273 complete and 0 interrupted iterations
default   [  44% ] 088/200 VUs  0m53.0s/2m00.0s

running (0m54.0s), 089/200 VUs, 2361 complete and 0 interrupted iterations
default   [  45% ] 089/200 VUs  0m54.0s/2m00.0s

running (0m55.0s), 091/200 VUs, 2439 complete and 0 interrupted iterations
default   [  46% ] 091/200 VUs  0m55.0s/2m00.0s

running (0m56.0s), 093/200 VUs, 2529 complete and 0 interrupted iterations
default   [  47% ] 093/200 VUs  0m56.0s/2m00.0s

running (0m57.0s), 094/200 VUs, 2621 complete and 0 interrupted iterations
default   [  47% ] 094/200 VUs  0m57.0s/2m00.0s

running (0m58.0s), 096/200 VUs, 2715 complete and 0 interrupted iterations
default   [  48% ] 096/200 VUs  0m58.0s/2m00.0s

running (0m59.0s), 098/200 VUs, 2811 complete and 0 interrupted iterations
default   [  49% ] 098/200 VUs  0m59.0s/2m00.0s

running (1m00.0s), 099/200 VUs, 2907 complete and 0 interrupted iterations
default   [  50% ] 099/200 VUs  1m00.0s/2m00.0s

running (1m01.0s), 101/200 VUs, 3006 complete and 0 interrupted iterations
default   [  51% ] 101/200 VUs  1m01.0s/2m00.0s

running (1m02.0s), 103/200 VUs, 3107 complete and 0 interrupted iterations
default   [  52% ] 103/200 VUs  1m02.0s/2m00.0s

running (1m03.0s), 104/200 VUs, 3209 complete and 0 interrupted iterations
default   [  52% ] 104/200 VUs  1m03.0s/2m00.0s

running (1m04.0s), 106/200 VUs, 3313 complete and 0 interrupted iterations
default   [  53% ] 106/200 VUs  1m04.0s/2m00.0s

running (1m05.0s), 108/200 VUs, 3417 complete and 0 interrupted iterations
default   [  54% ] 108/200 VUs  1m05.0s/2m00.0s

running (1m06.0s), 109/200 VUs, 3525 complete and 0 interrupted iterations
default   [  55% ] 109/200 VUs  1m06.0s/2m00.0s

running (1m07.0s), 111/200 VUs, 3632 complete and 0 interrupted iterations
default   [  56% ] 111/200 VUs  1m07.0s/2m00.0s

running (1m08.0s), 113/200 VUs, 3743 complete and 0 interrupted iterations
default   [  57% ] 113/200 VUs  1m08.0s/2m00.0s

running (1m09.0s), 114/200 VUs, 3856 complete and 0 interrupted iterations
default   [  57% ] 114/200 VUs  1m09.0s/2m00.0s

running (1m10.0s), 116/200 VUs, 3970 complete and 0 interrupted iterations
default   [  58% ] 116/200 VUs  1m10.0s/2m00.0s

running (1m11.0s), 118/200 VUs, 4084 complete and 0 interrupted iterations
default   [  59% ] 118/200 VUs  1m11.0s/2m00.0s

running (1m12.0s), 119/200 VUs, 4202 complete and 0 interrupted iterations
default   [  60% ] 119/200 VUs  1m12.0s/2m00.0s

running (1m13.0s), 121/200 VUs, 4320 complete and 0 interrupted iterations
default   [  61% ] 121/200 VUs  1m13.0s/2m00.0s

running (1m14.0s), 123/200 VUs, 4441 complete and 0 interrupted iterations
default   [  62% ] 123/200 VUs  1m14.0s/2m00.0s

running (1m15.0s), 124/200 VUs, 4564 complete and 0 interrupted iterations
default   [  62% ] 124/200 VUs  1m15.0s/2m00.0s

running (1m16.0s), 126/200 VUs, 4688 complete and 0 interrupted iterations
default   [  63% ] 126/200 VUs  1m16.0s/2m00.0s

running (1m17.0s), 128/200 VUs, 4814 complete and 0 interrupted iterations
default   [  64% ] 128/200 VUs  1m17.0s/2m00.0s

running (1m18.0s), 129/200 VUs, 4941 complete and 0 interrupted iterations
default   [  65% ] 129/200 VUs  1m18.0s/2m00.0s

running (1m19.0s), 131/200 VUs, 5070 complete and 0 interrupted iterations
default   [  66% ] 131/200 VUs  1m19.0s/2m00.0s

running (1m20.0s), 133/200 VUs, 5199 complete and 0 interrupted iterations
default   [  67% ] 133/200 VUs  1m20.0s/2m00.0s

running (1m21.0s), 134/200 VUs, 5331 complete and 0 interrupted iterations
default   [  67% ] 134/200 VUs  1m21.0s/2m00.0s

running (1m22.0s), 136/200 VUs, 5464 complete and 0 interrupted iterations
default   [  68% ] 136/200 VUs  1m22.0s/2m00.0s

running (1m23.0s), 138/200 VUs, 5599 complete and 0 interrupted iterations
default   [  69% ] 138/200 VUs  1m23.0s/2m00.0s

running (1m24.0s), 139/200 VUs, 5734 complete and 0 interrupted iterations
default   [  70% ] 139/200 VUs  1m24.0s/2m00.0s

running (1m25.0s), 141/200 VUs, 5851 complete and 0 interrupted iterations
default   [  71% ] 141/200 VUs  1m25.0s/2m00.0s

running (1m26.0s), 143/200 VUs, 5970 complete and 0 interrupted iterations
default   [  72% ] 143/200 VUs  1m26.0s/2m00.0s

running (1m27.0s), 144/200 VUs, 6092 complete and 0 interrupted iterations
default   [  72% ] 144/200 VUs  1m27.0s/2m00.0s

running (1m28.0s), 146/200 VUs, 6235 complete and 0 interrupted iterations
default   [  73% ] 146/200 VUs  1m28.0s/2m00.0s

running (1m29.0s), 148/200 VUs, 6381 complete and 0 interrupted iterations
default   [  74% ] 148/200 VUs  1m29.0s/2m00.0s

running (1m30.0s), 149/200 VUs, 6524 complete and 0 interrupted iterations
default   [  75% ] 149/200 VUs  1m30.0s/2m00.0s

running (1m31.0s), 151/200 VUs, 6668 complete and 0 interrupted iterations
default   [  76% ] 151/200 VUs  1m31.0s/2m00.0s

running (1m32.0s), 153/200 VUs, 6816 complete and 0 interrupted iterations
default   [  77% ] 153/200 VUs  1m32.0s/2m00.0s

running (1m33.0s), 154/200 VUs, 6959 complete and 0 interrupted iterations
default   [  77% ] 154/200 VUs  1m33.0s/2m00.0s

running (1m34.0s), 156/200 VUs, 7108 complete and 0 interrupted iterations
default   [  78% ] 156/200 VUs  1m34.0s/2m00.0s

running (1m35.0s), 158/200 VUs, 7263 complete and 0 interrupted iterations
default   [  79% ] 158/200 VUs  1m35.0s/2m00.0s

running (1m36.0s), 159/200 VUs, 7420 complete and 0 interrupted iterations
default   [  80% ] 159/200 VUs  1m36.0s/2m00.0s

running (1m37.0s), 161/200 VUs, 7578 complete and 0 interrupted iterations
default   [  81% ] 161/200 VUs  1m37.0s/2m00.0s

running (1m38.0s), 163/200 VUs, 7739 complete and 0 interrupted iterations
default   [  82% ] 163/200 VUs  1m38.0s/2m00.0s

running (1m39.0s), 164/200 VUs, 7901 complete and 0 interrupted iterations
default   [  82% ] 164/200 VUs  1m39.0s/2m00.0s

running (1m40.0s), 166/200 VUs, 8064 complete and 0 interrupted iterations
default   [  83% ] 166/200 VUs  1m40.0s/2m00.0s

running (1m41.0s), 168/200 VUs, 8223 complete and 0 interrupted iterations
default   [  84% ] 168/200 VUs  1m41.0s/2m00.0s

running (1m42.0s), 169/200 VUs, 8390 complete and 0 interrupted iterations
default   [  85% ] 169/200 VUs  1m42.0s/2m00.0s

running (1m43.0s), 171/200 VUs, 8559 complete and 0 interrupted iterations
default   [  86% ] 171/200 VUs  1m43.0s/2m00.0s

running (1m44.0s), 173/200 VUs, 8728 complete and 0 interrupted iterations
default   [  87% ] 173/200 VUs  1m44.0s/2m00.0s

running (1m45.0s), 174/200 VUs, 8901 complete and 0 interrupted iterations
default   [  87% ] 174/200 VUs  1m45.0s/2m00.0s

running (1m46.0s), 176/200 VUs, 9071 complete and 0 interrupted iterations
default   [  88% ] 176/200 VUs  1m46.0s/2m00.0s

running (1m47.0s), 178/200 VUs, 9246 complete and 0 interrupted iterations
default   [  89% ] 178/200 VUs  1m47.0s/2m00.0s

running (1m48.0s), 179/200 VUs, 9424 complete and 0 interrupted iterations
default   [  90% ] 179/200 VUs  1m48.0s/2m00.0s

running (1m49.0s), 181/200 VUs, 9598 complete and 0 interrupted iterations
default   [  91% ] 181/200 VUs  1m49.0s/2m00.0s

running (1m50.0s), 183/200 VUs, 9779 complete and 0 interrupted iterations
default   [  92% ] 183/200 VUs  1m50.0s/2m00.0s

running (1m51.0s), 184/200 VUs, 9961 complete and 0 interrupted iterations
default   [  92% ] 184/200 VUs  1m51.0s/2m00.0s

running (1m52.0s), 186/200 VUs, 10145 complete and 0 interrupted iterations
default   [  93% ] 186/200 VUs  1m52.0s/2m00.0s

running (1m53.0s), 188/200 VUs, 10329 complete and 0 interrupted iterations
default   [  94% ] 188/200 VUs  1m53.0s/2m00.0s

running (1m54.0s), 189/200 VUs, 10517 complete and 0 interrupted iterations
default   [  95% ] 189/200 VUs  1m54.0s/2m00.0s

running (1m55.0s), 191/200 VUs, 10704 complete and 0 interrupted iterations
default   [  96% ] 191/200 VUs  1m55.0s/2m00.0s

running (1m56.0s), 193/200 VUs, 10894 complete and 0 interrupted iterations
default   [  97% ] 193/200 VUs  1m56.0s/2m00.0s

running (1m57.0s), 194/200 VUs, 11087 complete and 0 interrupted iterations
default   [  97% ] 194/200 VUs  1m57.0s/2m00.0s

running (1m58.0s), 196/200 VUs, 11281 complete and 0 interrupted iterations
default   [  98% ] 196/200 VUs  1m58.0s/2m00.0s

running (1m59.0s), 198/200 VUs, 11475 complete and 0 interrupted iterations
default   [  99% ] 198/200 VUs  1m59.0s/2m00.0s

running (2m00.0s), 199/200 VUs, 11670 complete and 0 interrupted iterations
default   [ 100% ] 199/200 VUs  2m00.0s/2m00.0s

running (2m01.0s), 008/200 VUs, 11868 complete and 0 interrupted iterations
default Γåô [ 100% ] 199/200 VUs  2m0s

HASIL STRESSTEST
  Γûê TOTAL RESULTS 

    checks_total.......: 11876   98.145341/s
    checks_succeeded...: 100.00% 11876 out of 11876
    checks_failed......: 0.00%   0 out of 11876

    Γ£ô status is 200

    HTTP
    http_req_duration..............: avg=13.54ms min=310.2┬╡s med=3.71ms max=431.1ms p(90)=12.36ms p(95)=42.05ms
      { expected_response:true }...: avg=13.54ms min=310.2┬╡s med=3.71ms max=431.1ms p(90)=12.36ms p(95)=42.05ms
    http_req_failed................: 0.00%  0 out of 11876
    http_reqs......................: 11876  98.145341/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=1s      med=1s     max=1.43s   p(90)=1.01s   p(95)=1.04s  
    iterations.....................: 11876  98.145341/s
    vus............................: 8      min=2          max=199
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 106 MB 875 kB/s
    data_sent......................: 1.0 MB 8.3 kB/s

running (2m01.0s), 000/200 VUs, 11876 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 000/200 VUs  2m0s